adpyke.vscode-sql-formatter
adrianwilczynski.alpine-js-intellisense
albert.TabOut
aliariff.auto-add-brackets
antfu.iconify
Asuka.insertnumbers
bastienboutonnet.vscode-dbt
bibhasdn.unique-lines
bierner.lit-html
bmalehorn.vscode-fish
BriteSnow.vscode-toggle-quotes
brunnerh.insert-unicode
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
chunsen.bracket-select
damonsk.vscode-wardley-maps
DavidAnson.vscode-markdownlint
earshinov.permute-lines
EditorConfig.EditorConfig
ElecTreeFrying.insert-random-text
hbenl.vscode-test-explorer
henriblancke.vscode-dbt-formatter
KevinRose.vsc-python-indent
keyring.Lua
Koihik.vscode-lua-format
leodevbro.blockman
lokalise.i18n-ally
ms-python.black-formatter
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cpptools
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.test-adapter-converter
PKief.material-icon-theme
quicktype.quicktype
ritwickdey.LiveServer
rlivings39.fzf-quick-open
samuelcolvin.jinjahtml
skyapps.fish-vscode
streetsidesoftware.code-spell-checker
tushortz.python-extended-snippets
Tyriar.sort-lines
usernamehw.errorlens
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
