# Defined in /home/xk/.config/fish/functions/random.emoji.fish @ line 2
function random.emoji
    set -l suffix_chars \
        "🍓" "🌺" "🍭" "🧧" "💌" "🐲" "🐉" \
        "🍊" "🍋" "🥭" "🍯" "🥠" \
        "🌞" "🌻" "🥞" "🍋" "🥮" \
        "🌎" "🌍" "🌏" "🌾" "🍈" "🐉" "🐢" "🥥" "🫔" \
        "🌌" "🌠" "🐳" "🐬" "🐟" "🐠" "💬" \
        "🍞" "🌭" "🌮" "☕" "🥨" "🐄" "🦬" \
        "🦢" "🥡" "🍙" "🧃" "🪮" "🪭" \
        "🐧" "🐖" "🦓" \
        "🌸" "🦋" "🍉" "🦚" "🦜" "🪩" "🪅" "🪸" "🎠" "🎑" "🎴" "🪃" \
        "🪂" "🛝" "🧨" "🧮" "🐛"

    random choice $suffix_chars
end
